Th0masclassic/PROJECT_PINKEVA_TAG_w_SUBS/Test/Apple_FindMy_test/ESP32/sdkconfig.defaults
# Pinqeva production target baseline: ESP32-C3-MINI (RISC-V, BLE only).
CONFIG_IDF_TARGET="esp32c3"
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_BLE_SMP_ENABLE=y
CONFIG_BT_BLE_SMP_BOND_NVS_FLASH=y
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
# CONFIG_BT_BLE_50_FEATURES_SUPPORTED is not set
